Helier.org
* Helier
Commentary on Helier Robinson's /Perennial Philosophy/ series.

** Belief Shock (2002-2006)
*** False Belief
*** Identity and Change
(q 10)
#+BEGIN_QUOTE
The personal belief that we each have that each of us
is one person, changing with time, is false. Either
you are one person through time, in which case you
do not change; or else you are not one person through
time, because each time you change you are another,
new, numerically distinct, person. (quote 10)
#+END_QUOTE
**** Heraclitus and Parmenides
Heraclitus -> "Nothing is permanent except change"
Parmenides -> "All change is illusion"

**** Plato's Theory of Forms
Two worlds
- Empirical World (Illusory and fleeting) 
- Real World      (Unchanging and eternal)

**** Criticism of Democritus
**** Fallacy of Composition
**** Distributive and Compositional Properties
*** Five Realities
Five meanings of the word /REAL/.
**** Philosophers' Reality
Real is anything that exists independently of being perceived
**** Empirical Reality
All that we perceive around us that is potentially universally public
**** Reality as Truth
Likewise, the unreal is false
**** Real as Genuine
Helier is not concerned with this
**** Real as in Real Estate
Helier is not concerned with this
*** Naive Realism
/Naive Realism/ is the belief that the empirically real is theoretically real.
*** Metarealism
*** Some Sophistries
*** A Dilemma and Two Nutshells
*** Two Heads are Better than One
*** Leibniz and Russell
*** Four More Problems
*** More Details
*** Four Notes
*** Solipsism
*** Science
*** Philosophy of Science
*** Problems with Relations
*** Affirmation of Relations
*** Absolute Values
*** The Basis of Human Values
*** Nothing but the Best
*** Ego and Consciousness
*** Action, Belief and the Irrational
*** Discrimination and Language
*** Conflict and the Oge
*** Love and Hate
*** Introjection and Projection
*** Extremism, Heaven and Hell
*** Politics
*** Fanaticism and Tragedy
*** Dominance 
*** Neurosis
*** Feeling and Thinking
*** Mathematics and Music
*** The Problem of Universals
*** Four Kinds of Universal
*** Three Kinds of Meaning
*** Rational Feelings
*** Four More Gods
*** Practice Makes Perfect
** Renascent Rationalism 
** Relation Philosophy
