Helier.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Helier</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-08-14 14:51:25 EDT"/>
<meta name="author" content="Greg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Helier</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Helier </a>
<ul>
<li><a href="#sec-1.1">1.1 Belief Shock (2002-2006) </a>
<ul>
<li><a href="#sec-1.1.1">1.1.1 False Belief </a></li>
<li><a href="#sec-1.1.2">1.1.2 Identity and Change </a></li>
<li><a href="#sec-1.1.3">1.1.3 Five Realities </a></li>
<li><a href="#sec-1.1.4">1.1.4 Naive Realism </a></li>
<li><a href="#sec-1.1.5">1.1.5 Metarealism </a></li>
<li><a href="#sec-1.1.6">1.1.6 Some Sophistries </a></li>
<li><a href="#sec-1.1.7">1.1.7 A Dilemma and Two Nutshells </a></li>
<li><a href="#sec-1.1.8">1.1.8 Two Heads are Better than One </a></li>
<li><a href="#sec-1.1.9">1.1.9 Leibniz and Russell </a></li>
<li><a href="#sec-1.1.10">1.1.10 Four More Problems </a></li>
<li><a href="#sec-1.1.11">1.1.11 More Details </a></li>
<li><a href="#sec-1.1.12">1.1.12 Four Notes </a></li>
<li><a href="#sec-1.1.13">1.1.13 Solipsism </a></li>
<li><a href="#sec-1.1.14">1.1.14 Science </a></li>
<li><a href="#sec-1.1.15">1.1.15 Philosophy of Science </a></li>
<li><a href="#sec-1.1.16">1.1.16 Problems with Relations </a></li>
<li><a href="#sec-1.1.17">1.1.17 Affirmation of Relations </a></li>
<li><a href="#sec-1.1.18">1.1.18 Absolute Values </a></li>
<li><a href="#sec-1.1.19">1.1.19 The Basis of Human Values </a></li>
<li><a href="#sec-1.1.20">1.1.20 Nothing but the Best </a></li>
<li><a href="#sec-1.1.21">1.1.21 Ego and Consciousness </a></li>
<li><a href="#sec-1.1.22">1.1.22 Action, Belief and the Irrational </a></li>
<li><a href="#sec-1.1.23">1.1.23 Discrimination and Language </a></li>
<li><a href="#sec-1.1.24">1.1.24 Conflict and the Oge </a></li>
<li><a href="#sec-1.1.25">1.1.25 Love and Hate </a></li>
<li><a href="#sec-1.1.26">1.1.26 Introjection and Projection </a></li>
<li><a href="#sec-1.1.27">1.1.27 Extremism, Heaven and Hell </a></li>
<li><a href="#sec-1.1.28">1.1.28 Politics </a></li>
<li><a href="#sec-1.1.29">1.1.29 Fanaticism and Tragedy </a></li>
<li><a href="#sec-1.1.30">1.1.30 Dominance </a></li>
<li><a href="#sec-1.1.31">1.1.31 Neurosis </a></li>
<li><a href="#sec-1.1.32">1.1.32 Feeling and Thinking </a></li>
<li><a href="#sec-1.1.33">1.1.33 Mathematics and Music </a></li>
<li><a href="#sec-1.1.34">1.1.34 The Problem of Universals </a></li>
<li><a href="#sec-1.1.35">1.1.35 Four Kinds of Universal </a></li>
<li><a href="#sec-1.1.36">1.1.36 Three Kinds of Meaning </a></li>
<li><a href="#sec-1.1.37">1.1.37 Rational Feelings </a></li>
<li><a href="#sec-1.1.38">1.1.38 Four More Gods </a></li>
<li><a href="#sec-1.1.39">1.1.39 Practice Makes Perfect </a></li>
</ul>
</li>
<li><a href="#sec-1.2">1.2 Renascent Rationalism </a></li>
<li><a href="#sec-1.3">1.3 Relation Philosophy </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Helier </h2>
<div class="outline-text-2" id="text-1">

<p>Commentary on Helier Robinson's <i>Perennial Philosophy</i> series.
</p>

</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Belief Shock (2002-2006) </h3>
<div class="outline-text-3" id="text-1.1">


</div>

<div id="outline-container-1.1.1" class="outline-4">
<h4 id="sec-1.1.1"><span class="section-number-4">1.1.1</span> False Belief </h4>
<div class="outline-text-4" id="text-1.1.1">

</div>

</div>

<div id="outline-container-1.1.2" class="outline-4">
<h4 id="sec-1.1.2"><span class="section-number-4">1.1.2</span> Identity and Change </h4>
<div class="outline-text-4" id="text-1.1.2">

<p>(q 10)
</p><blockquote>

<p>The personal belief that we each have that each of us
is one person, changing with time, is false. Either
you are one person through time, in which case you
do not change; or else you are not one person through
time, because each time you change you are another,
new, numerically distinct, person. (quote 10)
</p>
</blockquote>

<ul>
<li id="sec-1.1.2.1">Heraclitus and Parmenides <br/>
Heraclitus -&gt; "Nothing is permanent except change"
Parmenides -&gt; "All change is illusion"

</li>
<li id="sec-1.1.2.2">Plato's Theory of Forms <br/>
Two worlds
<ul>
<li>
Empirical World (Illusory and fleeting) 
</li>
<li>
Real World      (Unchanging and eternal)

</li>
</ul>
</li>
<li id="sec-1.1.2.3">Criticism of Democritus <br/>
</li>
<li id="sec-1.1.2.4">Fallacy of Composition <br/>
</li>
<li id="sec-1.1.2.5">Distributive and Compositional Properties <br/>
</li>
</ul>
</div>

</div>

<div id="outline-container-1.1.3" class="outline-4">
<h4 id="sec-1.1.3"><span class="section-number-4">1.1.3</span> Five Realities </h4>
<div class="outline-text-4" id="text-1.1.3">

<p>Five meanings of the word <i>REAL</i>.
</p><ul>
<li id="sec-1.1.3.1">Philosophers' Reality <br/>
Real is anything that exists independently of being perceived
</li>
<li id="sec-1.1.3.2">Empirical Reality <br/>
All that we perceive around us that is potentially universally public
</li>
<li id="sec-1.1.3.3">Reality as Truth <br/>
Likewise, the unreal is false
</li>
<li id="sec-1.1.3.4">Real as Genuine <br/>
Helier is not concerned with this
</li>
<li id="sec-1.1.3.5">Real as in Real Estate <br/>
Helier is not concerned with this
</li>
</ul>
</div>

</div>

<div id="outline-container-1.1.4" class="outline-4">
<h4 id="sec-1.1.4"><span class="section-number-4">1.1.4</span> Naive Realism </h4>
<div class="outline-text-4" id="text-1.1.4">

<p><i>Naive Realism</i> is the belief that the empirically real is theoretically real.
</p></div>

</div>

<div id="outline-container-1.1.5" class="outline-4">
<h4 id="sec-1.1.5"><span class="section-number-4">1.1.5</span> Metarealism </h4>
<div class="outline-text-4" id="text-1.1.5">

</div>

</div>

<div id="outline-container-1.1.6" class="outline-4">
<h4 id="sec-1.1.6"><span class="section-number-4">1.1.6</span> Some Sophistries </h4>
<div class="outline-text-4" id="text-1.1.6">

</div>

</div>

<div id="outline-container-1.1.7" class="outline-4">
<h4 id="sec-1.1.7"><span class="section-number-4">1.1.7</span> A Dilemma and Two Nutshells </h4>
<div class="outline-text-4" id="text-1.1.7">

</div>

</div>

<div id="outline-container-1.1.8" class="outline-4">
<h4 id="sec-1.1.8"><span class="section-number-4">1.1.8</span> Two Heads are Better than One </h4>
<div class="outline-text-4" id="text-1.1.8">

</div>

</div>

<div id="outline-container-1.1.9" class="outline-4">
<h4 id="sec-1.1.9"><span class="section-number-4">1.1.9</span> Leibniz and Russell </h4>
<div class="outline-text-4" id="text-1.1.9">

</div>

</div>

<div id="outline-container-1.1.10" class="outline-4">
<h4 id="sec-1.1.10"><span class="section-number-4">1.1.10</span> Four More Problems </h4>
<div class="outline-text-4" id="text-1.1.10">

</div>

</div>

<div id="outline-container-1.1.11" class="outline-4">
<h4 id="sec-1.1.11"><span class="section-number-4">1.1.11</span> More Details </h4>
<div class="outline-text-4" id="text-1.1.11">

</div>

</div>

<div id="outline-container-1.1.12" class="outline-4">
<h4 id="sec-1.1.12"><span class="section-number-4">1.1.12</span> Four Notes </h4>
<div class="outline-text-4" id="text-1.1.12">

</div>

</div>

<div id="outline-container-1.1.13" class="outline-4">
<h4 id="sec-1.1.13"><span class="section-number-4">1.1.13</span> Solipsism </h4>
<div class="outline-text-4" id="text-1.1.13">

</div>

</div>

<div id="outline-container-1.1.14" class="outline-4">
<h4 id="sec-1.1.14"><span class="section-number-4">1.1.14</span> Science </h4>
<div class="outline-text-4" id="text-1.1.14">

</div>

</div>

<div id="outline-container-1.1.15" class="outline-4">
<h4 id="sec-1.1.15"><span class="section-number-4">1.1.15</span> Philosophy of Science </h4>
<div class="outline-text-4" id="text-1.1.15">

</div>

</div>

<div id="outline-container-1.1.16" class="outline-4">
<h4 id="sec-1.1.16"><span class="section-number-4">1.1.16</span> Problems with Relations </h4>
<div class="outline-text-4" id="text-1.1.16">

</div>

</div>

<div id="outline-container-1.1.17" class="outline-4">
<h4 id="sec-1.1.17"><span class="section-number-4">1.1.17</span> Affirmation of Relations </h4>
<div class="outline-text-4" id="text-1.1.17">

</div>

</div>

<div id="outline-container-1.1.18" class="outline-4">
<h4 id="sec-1.1.18"><span class="section-number-4">1.1.18</span> Absolute Values </h4>
<div class="outline-text-4" id="text-1.1.18">

</div>

</div>

<div id="outline-container-1.1.19" class="outline-4">
<h4 id="sec-1.1.19"><span class="section-number-4">1.1.19</span> The Basis of Human Values </h4>
<div class="outline-text-4" id="text-1.1.19">

</div>

</div>

<div id="outline-container-1.1.20" class="outline-4">
<h4 id="sec-1.1.20"><span class="section-number-4">1.1.20</span> Nothing but the Best </h4>
<div class="outline-text-4" id="text-1.1.20">

</div>

</div>

<div id="outline-container-1.1.21" class="outline-4">
<h4 id="sec-1.1.21"><span class="section-number-4">1.1.21</span> Ego and Consciousness </h4>
<div class="outline-text-4" id="text-1.1.21">

</div>

</div>

<div id="outline-container-1.1.22" class="outline-4">
<h4 id="sec-1.1.22"><span class="section-number-4">1.1.22</span> Action, Belief and the Irrational </h4>
<div class="outline-text-4" id="text-1.1.22">

</div>

</div>

<div id="outline-container-1.1.23" class="outline-4">
<h4 id="sec-1.1.23"><span class="section-number-4">1.1.23</span> Discrimination and Language </h4>
<div class="outline-text-4" id="text-1.1.23">

</div>

</div>

<div id="outline-container-1.1.24" class="outline-4">
<h4 id="sec-1.1.24"><span class="section-number-4">1.1.24</span> Conflict and the Oge </h4>
<div class="outline-text-4" id="text-1.1.24">

</div>

</div>

<div id="outline-container-1.1.25" class="outline-4">
<h4 id="sec-1.1.25"><span class="section-number-4">1.1.25</span> Love and Hate </h4>
<div class="outline-text-4" id="text-1.1.25">

</div>

</div>

<div id="outline-container-1.1.26" class="outline-4">
<h4 id="sec-1.1.26"><span class="section-number-4">1.1.26</span> Introjection and Projection </h4>
<div class="outline-text-4" id="text-1.1.26">

</div>

</div>

<div id="outline-container-1.1.27" class="outline-4">
<h4 id="sec-1.1.27"><span class="section-number-4">1.1.27</span> Extremism, Heaven and Hell </h4>
<div class="outline-text-4" id="text-1.1.27">

</div>

</div>

<div id="outline-container-1.1.28" class="outline-4">
<h4 id="sec-1.1.28"><span class="section-number-4">1.1.28</span> Politics </h4>
<div class="outline-text-4" id="text-1.1.28">

</div>

</div>

<div id="outline-container-1.1.29" class="outline-4">
<h4 id="sec-1.1.29"><span class="section-number-4">1.1.29</span> Fanaticism and Tragedy </h4>
<div class="outline-text-4" id="text-1.1.29">

</div>

</div>

<div id="outline-container-1.1.30" class="outline-4">
<h4 id="sec-1.1.30"><span class="section-number-4">1.1.30</span> Dominance </h4>
<div class="outline-text-4" id="text-1.1.30">

</div>

</div>

<div id="outline-container-1.1.31" class="outline-4">
<h4 id="sec-1.1.31"><span class="section-number-4">1.1.31</span> Neurosis </h4>
<div class="outline-text-4" id="text-1.1.31">

</div>

</div>

<div id="outline-container-1.1.32" class="outline-4">
<h4 id="sec-1.1.32"><span class="section-number-4">1.1.32</span> Feeling and Thinking </h4>
<div class="outline-text-4" id="text-1.1.32">

</div>

</div>

<div id="outline-container-1.1.33" class="outline-4">
<h4 id="sec-1.1.33"><span class="section-number-4">1.1.33</span> Mathematics and Music </h4>
<div class="outline-text-4" id="text-1.1.33">

</div>

</div>

<div id="outline-container-1.1.34" class="outline-4">
<h4 id="sec-1.1.34"><span class="section-number-4">1.1.34</span> The Problem of Universals </h4>
<div class="outline-text-4" id="text-1.1.34">

</div>

</div>

<div id="outline-container-1.1.35" class="outline-4">
<h4 id="sec-1.1.35"><span class="section-number-4">1.1.35</span> Four Kinds of Universal </h4>
<div class="outline-text-4" id="text-1.1.35">

</div>

</div>

<div id="outline-container-1.1.36" class="outline-4">
<h4 id="sec-1.1.36"><span class="section-number-4">1.1.36</span> Three Kinds of Meaning </h4>
<div class="outline-text-4" id="text-1.1.36">

</div>

</div>

<div id="outline-container-1.1.37" class="outline-4">
<h4 id="sec-1.1.37"><span class="section-number-4">1.1.37</span> Rational Feelings </h4>
<div class="outline-text-4" id="text-1.1.37">

</div>

</div>

<div id="outline-container-1.1.38" class="outline-4">
<h4 id="sec-1.1.38"><span class="section-number-4">1.1.38</span> Four More Gods </h4>
<div class="outline-text-4" id="text-1.1.38">

</div>

</div>

<div id="outline-container-1.1.39" class="outline-4">
<h4 id="sec-1.1.39"><span class="section-number-4">1.1.39</span> Practice Makes Perfect </h4>
<div class="outline-text-4" id="text-1.1.39">

</div>
</div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> Renascent Rationalism </h3>
<div class="outline-text-3" id="text-1.2">

</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Relation Philosophy </h3>
<div class="outline-text-3" id="text-1.3">

</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Greg
<a href="mailto:greg@greg-Satellite-C855D">&lt;greg@greg-Satellite-C855D&gt;</a>
</p>
<p class="date"> Date: 2013-08-14 14:51:25 EDT</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
